export default {
	id: 0,
	name: '畅销',
	male: [{
		class: '花都言情',
		books: [
			{"bid":"479232","title":"校花的贴身高手","author":"鱼人二代"},
			{"bid":"13528321","title":"透视小医神","author":"小萌狼"},
			{"bid":"520146","title":"极品全能学生","author":"花都大少"},
			{"bid":"660366","title":"茅山捉鬼人","author":"青子"},
			{"bid":"11420428","title":"极品透视小仙医","author":"流水曲觞"}
		]
	},{
		class: '异世大陆',
		books: [
			{"bid":"819435","title":"一念永恒","author":"耳根"},
			{"bid":"413455","title":"凌天战尊","author":"风轻扬"},
			{"bid":"661867","title":"永恒圣帝","author":"千寻月"},
			{"bid":"817386","title":"放开那个女巫","author":"二目"},
			{"bid":"804453","title":"龙王传说","author":"唐家三少"}
		]
	},{
		class: '热血狂战',
		books: [
			{"bid":"14608738","title":"圣墟","author":"辰东"},
			{"bid":"715580","title":"单兵为王","author":"七品"},
			{"bid":"462523","title":"大主宰","author":"天蚕土豆"},
			{"bid":"561940","title":"太古神王","author":"净无痕"},
			{"bid":"513571","title":"网游之逆天戒指","author":"上古圣贤"}
		]
	},{
		class: '沙场点兵',
		books: [
			{"bid":"295037","title":"最强兵王","author":"丛林狼"},
			{"bid":"738984","title":"抗日之特战兵王","author":"寂寞剑客"},
			{"bid":"523730","title":"三国之召唤猛将","author":"青铜剑客"},
			{"bid":"13772999","title":"龙组兵王","author":"尘风"},
			{"bid":"216428","title":"超级兵王在都市","author":"明日复明日"}
		]
	},{
		class: '位面重生',
		books: [
			{"bid":"648963","title":"万古神帝","author":"飞天鱼"},
			{"bid":"1001760719","title":"重生之都市修仙","author":"十里剑神"},
			{"bid":"462597","title":"帝霸","author":"厌笔萧生"},
			{"bid":"808100","title":"白袍总管","author":"萧舒"},
			{"bid":"13714606","title":"火影之最强震遁","author":"夜南听风"}
		]
	}],
	female: [{
		class: '豪门情缘',
		books: [
			{"bid":"13700974","title":"隔墙有男神：强行相爱100天","author":"叶非夜"},
			{"bid":"1000875951","title":"豪门少奶奶：谢少的心尖宠妻","author":"凤元糖果"},
			{"bid":"13691462","title":"99次离婚：厉少，请低调","author":"万里里"},
			{"bid":"839294","title":"烽火红颜，少帅的女人","author":"妤饵"},
			{"bid":"823451","title":"军长宠妻：重生农媳逆袭","author":"懒百合"}
		]
	},{
		class: '甜蜜爱恋',
		books: [
			{"bid":"13430981","title":"恶魔的专属：丫头，你好甜","author":"默小水"},
			{"bid":"13724396","title":"军婚绵绵：顾少，宠妻无度","author":"灿淼爱鱼"},
			{"bid":"13648272","title":"隐婚100分：惹火娇妻嫁一送一","author":"囧囧有妖"},
			{"bid":"791319","title":"完美恋人，首席已过期","author":"素痕残妆"},
			{"bid":"12819626","title":"隐婚蜜爱：偏执老公宠上瘾","author":"猪宝宝萌萌哒"}
		]
	},{
		class: '妃常嚣张',
		books: [
			{"bid":"11758803","title":"绝色妖娆：鬼医至尊","author":"凤炅"},
			{"bid":"610993","title":"神医弃女：邪王霸爱小狂妃","author":"蛇发优雅"},
			{"bid":"737545","title":"废材纨绔之腹黑邪妃","author":"柒月甜"},
			{"bid":"13302748","title":"医毒双绝：冥王的天才宠妃","author":"相思梓"},
			{"bid":"709317","title":"一品仙娇","author":"文飘过峰"}
		]
	},{
		class: '娘子当嫁',
		books: [
			{"bid":"13714997","title":"神医小毒妃：皇叔，别凶猛","author":"杨十九"},
			{"bid":"738867","title":"嫡女当嫁：一等世子妃","author":"奶油饼干"},
			{"bid":"817556","title":"摄政王绝宠之惑国煞妃","author":"温暖的月光"},
			{"bid":"827407","title":"喜劫良缘，纨绔俏医妃","author":"莉莉薇"},
			{"bid":"825825","title":"农女当道：山里老公好调教","author":"紫雪凝烟"}
		]
	},{
		class: '重生虐渣',
		books: [
			{"bid":"13565048","title":"快穿女配：反派BOSS有毒","author":"墨泠"},
			{"bid":"820350","title":"重生之至尊千金","author":"一路烦花"},
			{"bid":"814031","title":"嫡女重生：小妾不好欺","author":"夏染雪"},
			{"bid":"13755708","title":"七零年，有点甜","author":"七星草"},
			{"bid":"497218","title":"穿越未来之男人不好当","author":"汝夫人"}
		]
	}]
}