<template>
	<div class="Cards"
	@touchstart="touchstart($event)"
	@touchmove="touchmove($event)"
	@touchend="touchend($event)"
	@touchcancel="touchend($event)">
		<div class="paper__"
		:class="a.status"
		v-for="(a,i) in papers">
			<img class="paper" :src=" 'img/results/paper.png' "/>
			<div class="content">
				<div class="upper">
					<div class="header__">
						<div class="avatar"
						@click="TO_WRITER(i)">
							<img :src=" 'img/results/avatar_'+a.id+'.jpg' "/>
						</div>
						<div class="right__">
							<p class="name">{{a.name}}</p>
							<p class="intro">阅文集团签约作家</p>
						</div>
					</div>
					<p class="title">
						{{a.title}}
					</p>
					<p class="text_">
						{{a.article}}
					</p>
					<img class="to_text" :src=" 'img/results/to_text.png' "
					@click="SHOW_MASK(i)"/>
				</div>
				<div class="lower">
					<img class="cover" :src=" 'img/results/cover_'+a.id+'.jpg' "
					@click="TO_BOOK(i)"/>
					<div class="right__">
						<p class="title">
							{{a.book}}
						</p>
						<p class="text__">
							{{a.intro}}
						</p>
					</div>
				</div>
			</div>
		</div>
	</div>
</template>

<style lang="less" scoped>
	.Cards {
		position: relative;
		width: 100%; height: 9.1rem;
		margin-top: 3.42rem;
		perspective: 10rem;
		overflow: hidden;
		.first {
			animation: first 0.2s forwards;
		}
		.next {
			animation: next 0.2s forwards;
		}
		@keyframes first {
			0% {
				opacity: 1;
				z-index: 10;
			}
			100% {
				opacity: 1;
				z-index: 10;
			}
		}
		@keyframes next {
			0% {
				transform: translate3d(1rem,0.1rem,-1rem);
				opacity: 0.5;
				z-index: 5;
			}
			100% {
				transform: translate3d(1rem,0.1rem,-1rem);
				opacity: 0.5;
				z-index: 5;
			}
		}

		@keyframes leave {
			0% {
				opacity: 1;
				z-index: 10;
			}
			30% {
				transform: translate3d(-10rem,0,0);
				opacity: 1;
				z-index: 10;
			}
			60% {
				transform: translate3d(-10rem,0,-1rem);
				opacity: 0.5;
				z-index: 5;
			}
			100% {
				transform: translate3d(1rem,0.1rem,-1rem);
				opacity: 0.5;
				z-index: 5;
			}
		}
		.leave {
			animation: leave 0.7s ease-out forwards;
		}

		@keyframes enter {
			0% {
				transform: translate3d(1rem,0.1rem,-1rem);
				opacity: 0.5;
				z-index: 5;
			}

			100% {
				transform: translate3d(0,0,0);
				opacity: 1;
				z-index: 10;
			}
		}
		.enter {
			animation: enter ease-in-out 0.5s forwards;
		}

		.paper__ {
			position: absolute; left: 0.16rem;
			width: 5.99rem;
			.paper {
				width: 100%;
			}
			.content {
				position: absolute; left: 0; top: 0;
				width: 100%; height: 100%;
				.upper {
					width: 100%; height: 6.22rem;
					.header__ {
						padding-top: 0.4rem;
						padding-left: 0.54rem;
						overflow: hidden;
						.avatar {
							float: left;
							box-sizing: border-box;
							width: 0.76rem; height: 0.76rem;
							margin-right: 0.15rem;
							border-radius: 1000px;
							border: 0.07rem solid #796a4c;
							overflow: hidden;
							img {
								width: 100%; height: 100%;
							}
						}
						.right__ {
							float: left;
							.name {
								font-size: 0.24rem;
								line-height: 0.4rem;
							}
							.intro {
								font-size: 0.24rem;
								color: #796a4c;
							}
						}
					}
					.title {
						padding-top: 0.3rem;
						padding-bottom: 0.25rem;
						font-size: 0.36rem;
						color: #1e1404;
						text-align: center;
					}
					.text_ {
						height: 2rem;
						padding: 0 0.6rem;
						margin-bottom: 0.26rem;
						font-size: 0.24rem; line-height: 0.4rem;
						overflow: hidden;
					}
					.to_text {
						width: 2.74rem;
						margin: auto;
					}
				}
				.lower {
					.cover {
						float: left;
						width: 1.38rem; height: 1.71rem;
						margin-left: 0.6rem;
						margin-right: 0.3rem;
					}
					.right__ {
						float: left;
						width: 3.15rem;
						.title {
							margin-bottom: 0.18rem;
							font-size: 0.3rem;
							overflow: hidden;
							text-overflow: ellipsis;
							white-space: nowrap;
						}
						.text__ {
							font-size: 0.24rem;
							line-height: 0.4rem;
						}
					}
				}
			}
		}
	}
</style>

<script type="text/javascript">
	export default {
		props: ['act'],
		data: function(){
			return {
				papers: (function(){
					var arr = [];
					var cow = {
						status: '',
						id: 'cow',
						name: '丑牛1985',
						title: '惊悚工匠',
						article: '在古代民间，对于工匠都是非常尊敬的，家里建房子，做竹器，做木工，要请泥匠，篾匠，木匠到家里来干活，都得好生招待，饭菜讲究倒是没有，但是雇主都会极尽丰盛的款待。因为民间都知道，一旦工匠要害人，躲都躲不了。早期的工匠，不像现在全是机械化生产，不需要收徒弟了。那个时候是要收徒弟的，而且徒弟得跟着师傅学好几年。师傅在考察徒弟学艺能力同时，也要考察徒弟的人品，遇到了好的徒弟，师傅会传授一两套保命的东西，据说是茅山道术。',
						text: text_cow,
						bid: '750557',
						book: '抗日之将胆传奇',
						intro: '胡斌，特种部队总教官，因救人穿越到抗战时期，在战场上他杀小鬼子如屠鸡宰狗...'
					};
					var candy = {
						status: '',
						id: 'candy',
						name: '凤元糖果',
						title: '牵魂引',
						article: `夜色下，巫族禁地，阴森瑟瑟，毫无人气。绯清雅缓步走在禁地之中的莲花楼上，这座楼年久失修，每迈动一步，都会发出吱呀吱呀的声音，在寂静的夜色下，听在普通人耳中，格外的瘆人。因为她是阴月阴日生的女子，已年满十六，所以被家族选来侍奉“鬼少”。她没得选择，有时候人心比鬼更加的可怖。也不知道走了多久，这座莲花楼很高很高，仿佛通天而上。有传言说，只有在月圆之夜，这座莲花楼才会出现，听说没有活人敢踏入这样的地方，因为这里是巫族少爷巫千魅生活的地方，他不喜被打扰。可是谁都知道，那位巫族惊才绝艳的少爷，已经死去了百年。关于这位少爷，民间有太多太多的传说了。`,
						text: text_candy,
						bid: '1000875951',
						book: '豪门少奶奶：谢少的心尖宠妻',
						intro: '惨遭背叛，她的人生一团糟。绝境逢生，她找上权倾天下的谢少，站在这个男人...'
					};
					if( Math.random()>0.5 ){
						arr.push(cow,candy);
					}else{
						arr.push(candy,cow);
					};
					return arr;
				})(),

				moveCount: 0,
				canScroll: true,

				X0: null,
				X1: null,
				Y0: null,
				Y1: null
			}
		},
		mounted: function(){
			var self = this;
			window.addEventListener('load',function(){
				self.papers[0].status = 'next';
				self.papers[1].status = 'first';
			})
			//通知服务器用户进入了index.html页面。
			//Local.forceLog( common.param('act_f'),'index' );
		},
		methods: {
			TO_WRITER: function(i){
				this.act({
					type: 'TO_WRITER',
					id: this.papers[i].id
				})
			},
			TO_BOOK: function(i){
				this.act({
					type: 'TO_BOOK',
					id: this.papers[i].id,
					bid: this.papers[i].bid
				})
			},
			SHOW_MASK: function(i){
				this.act({
					type: 'SHOW_MASK',
					id: this.papers[i].id,
					title: this.papers[i].title,
					text: this.papers[i].text
				})
			},
			touchstart: function(e){
				this.moveCount = 0;
				this.canScroll = true;
				this.X0 = e.changedTouches[0].pageX;
				this.Y0 = e.changedTouches[0].pageY;
				console.log(this.X0)
			},
			touchmove: function(e){
				this.moveCount++;
				if( this.moveCount===1 ){
					this.X1 = e.changedTouches[0].pageX;
					this.Y1 = e.changedTouches[0].pageY;
					var dY = this.Y1 - this.Y0;
					var dX = this.X1 - this.X0;
					if( Math.abs(dY)>Math.abs(dX) ){
						this.canScroll = true;
					}else{
						this.canScroll = false;
					}
				};
				if( !this.canScroll ){
					e.preventDefault();
				}
			},
			touchend: function(e){
				if( !this.canScroll ){
					this.X1 = e.changedTouches[0].pageX;
					var dX = this.X1 - this.X0;
					if( dX<0 ){
						this.switch__();
					}
				}
			},
			switch__: function(){
				if( this.papers[0].status === 'enter' ){
					this.papers[0].status = 'leave';
					this.papers[1].status = 'enter';
				}else{
					this.papers[0].status = 'enter';
					this.papers[1].status = 'leave';
				}
			}
		}
	}
	var text_cow = `
	<p>在古代民间，对于工匠都是非常尊敬的，家里建房子，做竹器，做木工，要请泥匠，篾匠，木匠到家里来干活，都得好生招待，饭菜讲究倒是没有，但是雇主都会极尽丰盛的款待。因为民间都知道，一旦工匠要害人，躲都躲不了。</p>
	<p>早期的工匠，不像现在全是机械化生产，不需要收徒弟了。那个时候是要收徒弟的，而且徒弟得跟着师傅学好几年。</p>
	<p>师傅在考察徒弟学艺能力同时，也要考察徒弟的人品，遇到了好的徒弟，师傅会传授一两套保命的东西，据说是茅山道术。</p>
	<p>但是不是每个徒弟都有，一般心术不正的也不会教，这样不但害人，也会害了徒弟自己。</p>
	<p>据说使用这样的道术害人，如果被人破了，或者害人成功以后，也会伤及子孙后代，如果次数多了，还有可能绝后！</p>
	<p>话说在抗日年间，鬼子南下打下了江西，在靠近武汉方向，鬼子要修建地下工事，所以在当地抓了很多壮丁，而且在抓壮丁的时候，很多不愿意的，都被鬼子給杀了，所以鬼子在当地杀了不少人，他们抓到了人以后，就只管逼着干活，工人们是苦不堪言。</p>
	<p>其中有一个泥匠工叫汉生，打小学这个，帮人建房子，也建了20多年快30年了，本来家里还算可以的。</p>
	<p>他的大儿子是一个中校军官，但是日本人入侵中国以后，在淞沪会战牺牲了，二儿子是刚刚从军校毕业出来的尉官，在南京保卫战中牺牲了！他还有一个小儿子，本来合计就靠这个小儿子养老了，谁知道鬼子打进了江西以后，他的这个小儿子，也被鬼子給杀了。而他被带到了这边来修地下掩体。</p>
	<p>因为汉生是一个泥匠，所以鬼子就給了他一把泥刀（泥匠用的刀具，没有开刃的，比较厚重，用来砍断砖块的），让他专门砌掩体的墙。</p>
	<p>汉生刚开始还不知道怎么去給自己的儿子报仇，拿到了泥刀以后，他知道自己要做什么了。</p>
	<p>于是，干活的时候，他都会隔一段偷偷拿一块砖，背着鬼子在砖面上用泥刀刻两个小人，一男一女，尖牙利齿的，然后咬破手指，用自己的血抹在了小人身上，嘴里还念念有词，弄好了以后，砌到掩体上面，每隔一段他就弄一个。</p>
	<p>旁边几个泥匠慢慢也发现了他这样做，都是这个地方上的同行，大家都认识，而且这样的事情，同行看到了，也不会管！</p>
	<p>如果是在平时，帮着其他人家干活，看到了这样的，他们还会私下里找那个泥匠说一下，不要做的太过分，让人家家里绝了，因为泥匠能够破了同行的布置，到时候，布置这些东西的泥匠，就该倒霉了！而且要是建房子的人家知道了泥匠做的这个，也会去请其他的泥匠来破！</p>
	<p>但是现在，他们是在給鬼子干活，所以看到了也当没有看到。</p>
	<p>这天休息的时候，几个泥匠就坐到一块了。</p>
	<p>“汉生，你干嘛啊？布置了那么多？你不怕鬼子找你啊，万一他们要是请人破了你这个咒，你还要不要活了？”一个老工匠小声的问着汉生。</p>
	<p>“还活什么啊？我三个儿子都死了，老婆也死了，你说我还要活什么？”汉生坐在那里，咬着牙说道。</p>
	<p>“什么？三个儿子，都，都走了，怎么回事，没有听你说过啊？”那些泥匠听到了，都围了过来。</p>
	<p>他们之前根本就不知道汉生家的事情，就知道他有2个儿子读书了，当了军官，还有一个小儿子，也在县城读书！</p>
	<p>“大儿子死在上海，二儿子死在南京，小儿子，小儿子被小鬼子用刺刀捅了，死在我怀里！”汉生说着就哭了起来。</p>
	<p>那些泥匠听到了，全都沉默了！</p>
	<p>“哎！你该干啥干啥，我们会給其他的同行说，谁要来破，就不要怪我们不客气了！”其中一个老泥匠说道。</p>
	<p>“我不怕，我这个是死咒！”汉生抬起头来说道。</p>
	<p>“什么？”其他的人听到了，更加震惊，也就是说，汉生在布置完了以后，他自己会自杀，谁敢破咒，那些报应就会落到谁的身上！</p>
	<p>接下来1个多月，汉生画了100多块这样的砖，整个日本的地下掩体，全有这样的砖块。</p>
	<p>那些百姓被鬼子放了以后，汉生回到了家中，給自己的老婆孩子烧了大量的纸钱，人就悬在了房梁上面，再也没有醒来。</p>
	<p>很快，日本鬼子就进驻到了地下掩体当中，第一天晚上，鬼子在半睡半醒间，总能听到小孩尖锐的笑声，很多鬼子都被吓的坐了起来，看着四周，什么都没有。</p>
	<p>一个晚上，鬼子不知道醒来了多少次，他们也找过，就是没有找到声音的来源，晚上没有睡好，白天就打瞌睡，可是打瞌睡还是能够听到笑声。</p>
	<p>到了第二天晚上的时候，那些鬼子困的不行了，倒地就睡，睡到半夜，脸刺疼刺疼的，感觉有人挠自己，有的鬼子疼的醒来了，摸着脸，发现湿湿的，就到有灯光的地方去看，发现全是血，不知道怎么回事。</p>
	<p>接着，越来越多的鬼子疼醒了，他们发现很多人的脸都被挠烂了，有的还是被咬烂的，能够清楚的看到牙印，那些鬼子看起来非常恐怖，血肉模糊，只能找来医生止血！</p>
	<p>鬼子想要知道到底是怎么回事，是不是有什么虫子，但是他们检查了很多遍，什么都没有。</p>
	<p>第三天晚上，鬼子还是困的不行，继续睡觉，还有人专门坐在那里值班，那些值班的鬼子，抱着枪迷迷糊糊的，其中一个鬼子感觉有人挠自己，就用手去拍，啪的一声打在自己的脸上，不但自己給疼清醒了，还把其他的人給吓醒了，那些鬼子看到没事，就继续睡着。</p>
	<p>突然“轰”的一声，一个值班打瞌睡的鬼子腰间的手雷爆炸了，也不知道是怎么回事，还炸伤了好几个，死了2个！</p>
	<p>鬼子有点怕了，于是不想在掩体里面睡，但是武汉会战那个时候已经打响了，这边是重要的一道防线，所以，上面的命令是必须在这里守着。</p>
	<p>接下来，每天晚上都有死伤的鬼子，有的鬼子明明把子弹退膛了，枪居然还响了，还能打死人。</p>
	<p>而鬼子的手雷也很奇怪，本来鬼子的手雷是要拔掉保险以后，敲一下，扔出去才会爆炸的，而鬼子的手雷，经常无缘无故的从腰间掉下来，保险还松了，落在地上的时候，鬼子正在走路踢了一下，居然炸了！</p>
	<p>最让鬼子难受的是，他们晚上根本就不要想睡觉，只要睡觉，肯定是会被疼醒的，而且身上到处都是指甲挠的伤口，和血迹。</p>
	<p>整个地下掩体里面，有鬼子一个大队的士兵，从鬼子大队长到下面的士兵，每个人身上都是带伤的，而且精神非常的萎靡。</p>
	<p>鬼子的大队长几次想要调出这个地方，但是上面的命令坚持要他们坚守在这里，逼的鬼子没有办法，晚上只能去掩体外面的空地上睡觉。</p>
	<p>但是白天，他们不敢在外面，那个时候正在打仗，他们必须要进入到掩体里面，每天，掩体里不是传来爆炸声，就是枪声，每天都要一两个倒霉的鬼子死的匪夷所思。</p>
	<p>半个月以后，鬼子知道这里肯定有不干净的东西，就去请来道士，希望他能够做法，道士来了，看一下说不行，这个东西他破不了！</p>
	<p>不过也告诉了鬼子，这个是泥匠弄的，必须要找到泥匠来破解才行，而且必须要找到当时布置的那个泥匠才可以。</p>
	<p>于是，鬼子就去找之前在修掩体的那些泥匠，但是一个都没有找到，不但之前的那些泥匠找不到，就是附近几百里的泥匠都跑光了。</p>
	<p>他们都知道汉生布置了死咒，谁去破解，报应就会落在谁的身上，加上这里正在打仗，百姓们也逃难了，所以，鬼子找了几天，没有抓到一个泥匠回来，只能继续熬着。</p>
	<p>几天以后，中国的部队发现了鬼子晚上都是在掩体外面睡觉，就摸了过去，当天晚上，中国的部队就把这个掩体里面的鬼子給全歼了。</p>
	`;
	var text_candy = `
	<p>夜色下，巫族禁地，阴森瑟瑟，毫无人气。</p>
	<p>绯清雅缓步走在禁地之中的莲花楼上，这座楼年久失修，每迈动一步，都会发出吱呀吱呀的声音，在寂静的夜色下，听在普通人耳中，格外的瘆人。</p>
	<p>因为她是阴月阴日生的女子，已年满十六，所以被家族选来侍奉“鬼少”。</p>
	<p>她没得选择，有时候人心比鬼更加的可怖。</p>
	<p>也不知道走了多久，这座莲花楼很高很高，仿佛通天而上。</p>
	<p>有传言说，只有在月圆之夜，这座莲花楼才会出现，听说没有活人敢踏入这样的地方，因为这里是巫族少爷巫千魅生活的地方，他不喜被打扰。</p>
	<p>可是谁都知道，那位巫族惊才绝艳的少爷，已经死去了百年。</p>
	<p>关于这位少爷，民间有太多太多的传说了。</p>
	<p>绯清雅咬了咬唇瓣，定了定心神，继续往上走，因为她能感觉到，若是她停下来，就会被这股阴风冻僵。</p>
	<p>终于踏入了莲花楼中，绯清雅刚喘口气，就听到楼上的铃铛不断响动，虽然声音很清脆，但还是突然吓了绯清雅一跳。</p>
	<p>“咯咯，来活人了……”</p>
	<p>“又一个送死的……”</p>
	<p>“人心呀，贪婪成性……”</p>
	<p>“用不用通知少爷？或许会是少爷等的人也说不定。”</p>
	<p>……</p>
	<p>阴风瑟瑟，阴冷的声音响彻在耳边，绯清雅忍不住全身发抖，上下牙齿都在打颤，真的有鬼？</p>
	<p>她两只手握成拳头，努力让自己不晕倒。</p>
	<p>这时候，她睁开眼睛看着前方，发现那里挂着一副古画，虽然只是一眼，但她还是被画给吸引住了心神，都忘记了害怕。</p>
	<p>画上画的是一位男子，锦衣玉华，精致绝伦，出尘脱俗，他拿着玉笛优雅的站着，嘴角挂着浅浅的笑意，让人看了如沐春风，他整个人仿佛敛尽天地的风华……</p>
	<p>绯清雅一时间再找不到词语来形容画中的人。</p>
	<p>她想起传言说，莲花楼中的鬼少，也就是巫千魅，他在百年前，也是风华绝代的人物，难道这幅画中的人是他？</p>
	<p>“好看吗？”</p>
	<p>在绯清雅出神的时候，突然耳边响起一个幽谷空灵的声音，她豁然转身看去，惊的连连后退，什么时候画里的人竟然出现在身边，她为什么都没察觉？</p>
	<p>“别怕！”男子清润的声音带着一丝的凄清，却似安抚绯清雅的情绪。</p>
	<p>绯清雅瞪大眼睛看着眼前如月华幻影般的影像，她哆嗦着唇瓣，问道：“你……是人，是鬼？”</p>
	<p>男子深深的看着绯清雅，眼底的伤痛那么的明显，似有哀怨，痴缠，痛苦……</p>
	<p>绯清雅看着这样的目光，不知为何，心底竟然也跟着疼了起来。</p>
	<p>“如果我是鬼，你会怕吗？”</p>
	<p>绯清雅已经后退到了桌子前，她将手按在桌子上，努力撑住自己，不让自己倒下。</p>
	<p>“你……你会吃了我吗？”</p>
	<p>听到这句话，男子突然轻轻笑了起来，他笑起来特别的好看，芝兰玉树，泣血如华，风华无双……</p>
	<p>而且声音仿佛悠远的琴音，那样的悦耳低沉，让人忍不住沉醉其中。</p>
	<p>须臾，男子止住了笑容，他精致的眉眼深深的锁住绯清雅的眸光，道：“如果我说会吃了你呢？”</p>
	<p>绯清雅不断的摇头，“你别吃我，我不好吃的……我可以做很多事情，也可以陪你解闷，我会讲故事……”</p>
	<p>她绞尽脑汁的想理由，但是平日就不太爱说的人，到了这个时候，也实在想不出太具有说服力的理由。</p>
	<p>突然她眼眸大亮，“你……你是巫千魅是吗？都说你生前最好了，你就算是个鬼，也是个好鬼，你放了我，好不好？只要别吃我就行。”</p>
	<p>男子空灵幽叹一声，在寂静的楼宇上，多了苍凉的意味。</p>
	<p>“傻瓜，我说的吃，不是你以为的吃。”</p>
	<p>听到这句话，绯清雅提着的心才落下，这一会功夫，她已经惊惧的全身出冷汗了。</p>
	<p>“呵，生前好吗？可是我却伤害了我的妻子。”</p>
	<p>绯清雅没插话，她感觉到眼前这个鬼心情不好，她还是少惹他为好。</p>
	<p>她是听说过的，巫千魅的妻子死后，他性情大变，杀了巫族的很多人，那一场变故后，巫族在南恒国的地位一落千丈。</p>
	<p>看着巫千魅萧瑟虚幻的身影，绯清雅说不清心里是什么感受，她就觉得自己心里很疼很闷，有些呼吸不上来。</p>
	<p>她忍不住开口道：“你……你生前，不爱你的妻子，为什么要娶她？”</p>
	<p>男子突然神色一厉，道：“谁说我不爱她？”</p>
	<p>绯清雅被这突然放大的声音吓了一跳，再不敢说话。</p>
	<p>巫千魅虚幻的身影缓缓靠近绯清雅，温声道：“清清，别怕我好吗？”</p>
	<p>听着这句话，绯清雅本来发抖的身体突然间慢慢平复下来，也许她真的不怕了。</p>
	<p>巫千魅缓缓伸手抱住绯清雅，“我终于找到你了，我等了你百年。”</p>
	<p>“为什么我的心好疼，好疼……”绯清雅突然脸色发白，捂着心口，缓缓蹲下。</p>
	<p>“清清，记住，你是我的妻子，我爱你。”</p>
	<p>“我不是，我不是，好疼……”绯清雅感觉脑海里似乎有什么影像一下子涌入她的脑海里。</p>
	<p>好像是她和眼前男子生活的影像。</p>
	<p>他们难道真的认识？她是他的妻子吗？</p>
	<p>月华中上，巫千魅身体的幻影越来越飘渺，仿佛要飘散开，他轻声道：“清清，你跟我来，跟我来就不疼了……”</p>
	<p>绯清雅恍惚的跟着男子的幻影往前走，整个人走出了莲花楼，瞬间踩空，“啊”的一声，从莲花楼上掉落下……</p>
	<p>……</p>
	<p>巫族，清月居</p>
	<p>“啊……”的一声，绯清雅一下子醒了过来，惊坐起，然后大口大口的喘息。</p>
	<p>“夫人，怎么了？做梦了吗？”一个温柔的声音在耳边响起，一双修长如玉的手轻轻的给她擦拭额头上的汗。</p>
	<p>绯清雅低头一看，大红鸳鸯锦被，自己竟然不着寸缕，她偏头看着身边的人，墨发散落，眉眼如画，是巫千魅没错。</p>
	<p>“你是人是鬼？”</p>
	<p>巫千魅神色微变，然后揽过绯清雅，低头吻了吻她的唇瓣，“夫人说胡话了，今夜是我们的洞房花烛夜。”</p>
	<p>在巫千魅的安抚下，绯清雅缓缓回神，她摸着巫千魅的手臂，有温度的，他是人！</p>
	<p>那她又是谁？</p>
	<p>巫千魅抱着绯清雅，耐心的道：“你忘了吗？你是绯家的小姐，我们自幼定亲，如今已经成亲，而且昨夜我们也已圆房。”</p>
	<p>绯清雅将之前的事情也想起来了，问道：“你不是不满意这门亲事吗？”</p>
	<p>巫千魅叹了口气道：“这是我自己求来的，怎会不满意，从进往后你是我的妻子，我会爱你护你，不让你受任何委屈。”</p>
	<p>绯清雅怔怔的看了巫千魅半晌，他说的像是真的一样。</p>
	<p>可是她的头特别的混乱，太多太多的影像涌入脑海里，她分不清梦境还是现实。</p>
	<p>绯清雅使劲的捶打自己的头。</p>
	<p>巫千魅心疼道：“别伤害自己。”</p>
	<p>连续很长一段时间，绯清雅都分不清梦境和现实，但是巫千魅对她是真的很好很好，外面的人都羡慕她。</p>
	<p>可她就是觉得不真实，之前她父亲还说，巫族的少爷不满意这门亲事，还想退婚。</p>
	<p>后来又是什么让巫千魅改变主意呢？</p>
	<p>对绯清雅来说，这中间有太多太多的谜团。</p>
	<p>她觉得越不真实，巫千魅对她就越是好，她喜欢的东西，他都会弄来给她玩，她想吃的，再远，他也会让人去弄来给她吃。</p>
	<p>而且他还是整个国度公认的大善人，他每年都会捐赠很多物资给百姓，还会拿钱修路，有人需要帮助，他都尽量伸出援助之手。</p>
	<p>他太过美好，自然有人将主意打到他身上，都想送女人给他，可是巫千魅全部都拒绝了。</p>
	<p>有一天夜里，恩爱后，绯清雅忍不住问他，“你为什么独独对我好？比我漂亮聪明的女人有很多。”</p>
	<p>“可是他们都不是清清你。”</p>
	<p>日子就这样按部就班的过着，直到有一天，绯清雅遇到了一位道士。</p>
	<p>那位道士似乎要赶路，看到绯清雅在施粥，他疑了一声，来到绯清雅面前，“这位夫人，你本是不该存在这世上的人，为何还好好的，奇哉，怪哉！不过积善成德，延续寿命，也不算奇事了。”</p>
	<p>绯清雅手中拿着的勺子一下子掉落在地，她全身跟着发抖。</p>
	<p>“夫人，夫人，您怎么了？”</p>
	<p>等绯清雅再次回神的时候，她已经躺在了床上，巫千魅紧紧的握着她的手，眼中全是担忧和心疼。</p>
	<p>之后，绯清雅发了疯似得开始找莲花楼，甚至是巫族禁地。</p>
	<p>可是所有人都告诉她，没有什么莲花楼。</p>
	<p>直到有一次，巫千魅外出，绯清雅在月圆之夜按照梦中的记忆找到了禁地，在地面上找到了一滩血迹，那应该是她掉落莲花楼的地方。</p>
	<p>绯清雅吓的全身发抖。</p>
	<p>“这是你的重生，是巫族少爷利用家族秘术，逆天而行，让你们重来一世。”</p>
	<p>绯清雅回头一看，竟然是那天的道士，“大师，我是鬼吗？”</p>
	<p>“不，你是人。”</p>
	<p>“那巫千魅呢？”</p>
	<p>“他也是人。”</p>
	<p>“这到底是怎么一回事？”</p>
	<p>“前生你被爱情所伤，误会重重，后你身死，真相大白，巫千魅施展秘术，为你殉情，受尽百年凄苦，等你百年，才有这一世，夫人回去吧！”</p>
	<p>“我想知道前生的一切。”</p>
	<p>“前尘往事皆为过往，何必执着，执着便是执念，放下才能重生。”</p>
	<p>之后，道士离去，禁地和莲花台也彻底消失了，而绯清雅也跟着昏迷不醒。</p>
	<p>等她再次醒来的时候，发现巫千魅握住她的手在哭。</p>
	<p>“清清，醒来好吗？我不能没有你，清清……”</p>
	<p>“千魅！”</p>
	<p>“清清你终于醒了，你可知道，你有了孩子，我们的孩子。”</p>
	<p>“是孩子吗？”</p>
	<p>巫千魅点了点头。</p>
	<p>绯清雅双手放在肚子上，想到大师最后说的话，再看巫千魅痛苦的神情，她轻轻的给他将眼泪擦去。“以后我们好好生活。”</p>
	<p>巫千魅吻了吻绯清雅的手指，“好。”</p>
	<p>放下执念后的绯清雅和巫千魅也过起了不羡鸳鸯不羡仙的生活。</p>
	<p>直到两人寿命将尽的时候，绯清雅才问巫千魅，“你记得前生的一切吗？”</p>
	<p>“记得，清清，我对不起你。”</p>
	<p>绯清雅笑着摇了摇头，“这一生，你给了我幸福，过去的事情就是前尘过往了。”</p>
	<p>她终于明白了大师的话，执着便是执念，只会困住自己，若是自己一直执着，未必能享受这几十年恩爱的生活。</p>
	`;
</script>