var bookdata = {
    "0": [{
        "cover":"book1-1",
        "bid": "788041",
        "name": "侯卫东官场笔记",
        "intro": "公务员必读！逐层讲透村、镇、县、市、省官场现状。",
        "tag": "官场生存手册"
    }, {
        "cover":"book1-2",
        "bid": "803852",
        "name": "太子妃升职记",
        "intro": "独家影视原著，好色太子妃性别错位、笑料迭出。",
        "tag": "浓浓的魔性美"
    }, {
        "cover":"book1-3",
        "bid": "236487",
        "name": "最好的我们",
        "intro": "这一次，与整个青春作别！将情怀与感动，写到极致。",
        "tag": "怀旧那年青春"
    }, {
        "cover":"book1-4",
        "bid": "837398",
        "name": "我有故事你有酒吗",
        "intro": "愿我的故事绿水长流，敬你的孤独择日而终。",
        "tag": "一碗别样鸡汤"
    }, {
        "cover":"book1-5",
        "bid": "695233",
        "name": "三体",
        "intro": "单枪匹马，把中国科幻提升到了世界水平的神作！"
    }, {
        "cover":"book1-6",
        "bid": "828048",
        "name": "向着光亮那方",
        "intro": "只有经历过青春的迷茫，才能与孤独握手言欢！"
    }, {
        "cover":"book1-7",
        "bid": "808460",
        "name": "我不喜欢这世界，我只喜欢你",
        "intro": "暖！萌！甜！每一段都令人笑出声来，然后默默流泪。"
    }, {
        "cover":"book1-8",
        "bid": "715280",
        "name": "大江东去",
        "intro": "《欢乐颂》作者阿耐代表作，描写改革开放30年的奇书！"
    }, {
        "cover":"book1-9",
        "bid": "825760",
        "name": "鱼羊野史",
        "intro": "高晓松为你讲述，每一天在历史上发生的大事、趣事！"
    }, {
        "cover":"book1-10",
        "bid": "810297",
        "name": "自控力:和压力做朋友",
        "intro": "教你如何与压力共存，一本现代社会生存指南。"
    }],
    "1": [{
        "cover":"book2-1",
        "bid": "829461",
        "name": "爱的小黄书",
        "intro": "揭示爱与性的奇妙定律，还讲了些有趣的小实验。",
        "tag": "真不是小黄书"
    }, {
        "cover":"book2-2",
        "bid": "825037",
        "name": "我不是潘金莲",
        "intro": "被戴绿帽子的女人，无数的折腾，不过想纠正一句话。",
        "tag": "嗯嗯我真信了"
    }, {
        "cover":"book2-3",
        "bid": "244786",
        "name": "从你的全世界路过",
        "intro": "5个故事变成电影，每分钟，都有人在电影中看到自己。",
        "tag": "年少时曾追过"
    }, {
        "cover":"book2-4",
        "bid": "839023",
        "name": "你也是蘑菇吗？",
        "intro": "精神病人脑洞故事集，108个让人哭笑不得的暖心细节。",
        "tag": "脑洞开思维广"
    }, {
        "cover":"book2-5",
        "bid": "216212",
        "name": "小王子",
        "intro": "一本触及灵魂的枕边书，一部地球人必看的童话。"
    }, {
        "cover":"book2-6",
        "bid": "839030",
        "name": "恶意",
        "intro": "《白夜行》为爱粉身碎骨，《恶意》因恨万劫不复。"
    }, {
        "cover":"book2-7",
        "bid": "414951",
        "name": "愿有人陪你颠沛流离",
        "intro": "愿那些错过的人，经历了颠沛流离之后还能再度相逢。"
    }, {
        "cover":"book2-8",
        "bid": "449736",
        "name": "渡边淳一：失乐园",
        "intro": "渡边淳一欲情小说代表作，全球畅销17载。"
    }, {
        "cover":"book2-9",
        "bid": "813823",
        "name": "人性的弱点",
        "intro": "全球销量仅次于《圣经》的书！真想看看到底写的啥。"
    }, {
        "cover":"book2-10",
        "bid": "172299",
        "name": "废都",
        "intro": "被禁十六年、毁誉参半，一本“被有名”的奇书。"
    }],
    "2": [{
        "cover":"book3-1",
        "bid": "803852",
        "name": "太子妃升职记",
        "intro": "独家影视原著，好色太子妃性别错位、笑料迭出。",
        "tag": "浓浓的魔性美"
    }, {
        "cover":"book3-2",
        "bid": "815339",
        "name": "欢乐颂",
        "intro": "原著中的她们，不光坚强，还真实得能让人对号入座。",
        "tag": "最爱这五只啦"
    }, {
        "cover":"book3-3",
        "bid": "164524",
        "name": "微微一笑很倾城",
        "intro": "情侣档力荐，收录历年来所有番外！还不快来看？",
        "tag": "高帅富游戏宅"
    }, {
        "cover":"book3-4",
        "bid": "236487",
        "name": "最好的我们",
        "intro": "这一次，与整个青春作别！将情怀与感动，写到极致。",
        "tag": "怀旧那年青春"
    }, {
        "cover":"book3-5",
        "bid": "529015",
        "name": "鬼吹灯",
        "intro": "盗墓类小说鼻祖，诡奇幻想的地下世界，正宗摸金范！"
    }, {
        "cover":"book3-6",
        "bid": "216147",
        "name": "如果蜗牛有爱情",
        "intro": "他们这么心有灵犀，如果还追不到，真是没天理！"
    }, {
        "cover":"book3-7",
        "bid": "842452",
        "name": "法医秦明系列",
        "intro": "真正的法医亲笔记录，故事灵感均源自真实案件！"
    }, {
        "cover":"book3-8",
        "bid": "817469",
        "name": "夏有乔木：雅望天堂",
        "intro": "原来，沉重的爱情故事，会留在我们心上那么长……"
    }, {
        "cover":"book3-9",
        "bid": "11366903",
        "name": "爵迹",
        "intro": "地、火、水、风，共同构建起一个广袤的奇幻世界。"
    }, {
        "cover":"book3-10",
        "bid": "833698",
        "name": "沥川往事",
        "intro": "生死相依的爱情总是干渴的，除非你遇到沥川……"
    }],
    "3": [{
        "cover":"book6-1",
        "bid": "520500",
        "name": "文艺女青年这种病",
        "intro": "不食人间烟火、伤春悲秋……这是病，得治！",
        "tag": "如何搞定文青"
    }, {
        "cover":"book6-2",
        "bid": "740261",
        "name": "如何处理仇人的骨灰",
        "intro": "因为心里有爱，你才会耐心的读这样一本书。",
        "tag": "仇恨还是原谅"
    }, {
        "cover":"book6-3",
        "bid": "758957",
        "name": "这书能让你戒烟",
        "intro": "如果你是一个吸烟者，只要读下去就可以了。",
        "tag": "吸烟者必读书"
    }, {
        "cover":"book6-4",
        "bid": "681638",
        "name": "乌克兰拖拉机简史",
        "intro": "畅销33国的黑色喜剧杰作，令无数读者笑到落泪。",
        "tag": "拖拉机不重要"
    }, {
        "cover":"book6-5",
        "bid": "621682",
        "name": "如何成为一个妖孽",
        "intro": "戳痒处令人拍案叫绝，戳痛处让人羞愤无地。"
    }, {
        "cover":"book6-6",
        "bid": "221722",
        "name": "我讲个笑话，你可别哭啊",
        "intro": "他就是有这项技能：将悲惨的事，当笑话般讲出来。"
    }, {
        "cover":"book6-7",
        "bid": "181989",
        "name": "我知道你不知道的自己在想什么",
        "intro": "来自果壳阅读，真正靠谱的日常心理现象分析。"
    }, {
        "cover":"book6-8",
        "bid": "848146",
        "name": "普通青年回答不了的，就问张公子吧",
        "intro": "解答那些，连Google都不知道的那些困惑。"
    }, {
        "cover":"book6-9",
        "bid": "673285",
        "name": "我们这儿是精神病院",
        "intro": "一部思维广、欢乐多的真实版《飞跃疯人院》。"
    }, {
        "cover":"book6-10",
        "bid": "749898",
        "name": "维罗妮卡决定去死",
        "intro": "一次冒险，胜过一千个安逸的日子，不是吗？"
    }],
    "4": [{
        "cover":"book5-1",
        "bid": "213422",
        "name": "王宝强自传:向前进",
        "intro": "八卦背后的王宝强，他从草根到明星的蜕变。",
        "tag": "不抛弃不放弃"
    }, {
        "cover":"book5-2",
        "bid": "752695",
        "name": "绝望锻炼了我",
        "intro": "嫁给韩国的女人，看她绝望与希望交织的人生。",
        "tag": "丑闻早有伏笔"
    }, {
        "cover":"book5-3",
        "bid": "845396",
        "name": "从商人到总统",
        "intro": "不按规矩出牌的搅局者，为啥最终成了赢家？",
        "tag": "他将入主白宫"
    }, {
        "cover":"book5-4",
        "bid": "635715",
        "name": "希拉里传",
        "intro": "近距离观察希拉里，感受她过往历程的得与失。",
        "tag": "她的总统情结"
    }, {
        "cover":"book5-5",
        "bid": "215120",
        "name": "直到世界尽头",
        "intro": "他在自传中透露，14岁时就对谢杏芳一见钟情。"
    }, {
        "cover":"book5-6",
        "bid": "642461",
        "name": "过得刚好",
        "intro": "郭德纲亲笔作品，讲述人生四十年的江湖过往。"
    }, {
        "cover":"book5-7",
        "bid": "685277",
        "name": "我的成功是别人不再需要我",
        "intro": "王石如是说，如今，一语成谶！他，总有一天要离开……"
    }, {
        "cover":"book5-8",
        "bid": "836707",
        "name": "习惯就好",
        "intro": "独立女人田朴珺，笑看偏见传闻！王石不推荐？习惯就好！"
    }, {
        "cover":"book5-9",
        "bid": "636387",
        "name": "万达哲学",
        "intro": "“国民公公”王健林，首次自述做人、做生意之道。"
    }, {
        "cover":"book5-10",
        "bid": "849742",
        "name": "不省心",
        "intro": "铁嘴名导冯小刚，道五十载人生路。沉淀之作，不省心。"
    }],
    "5": [{
        "cover":"book4-1",
        "bid": "831910",
        "name": "绝对小孩2",
        "intro": "童言无忌，100%非大人观点！适合9～99岁。",
        "tag": "童言真的无忌"
    }, {
        "cover":"book4-2",
        "bid": "841899",
        "name": "地狱",
        "intro": "一个好的作家，确实拥有某种类似预言家的潜质。",
        "tag": "达芬奇又密码"
    }, {
        "cover":"book4-3",
        "bid": "839029",
        "name": "我可以咬一口吗",
        "intro": "这书有这样的魔力，让你不由自主地会心一笑。",
        "tag": "超软萌超口耐"
    }, {
        "cover":"book4-4",
        "bid": "840996",
        "name": "好吗好的",
        "intro": "在寒冷之地，读些暖心、真实、舍不得读完的故事。",
        "tag": "给善良充点值"
    }, {
        "cover":"book4-5",
        "bid": "817728",
        "name": "父与子",
        "intro": "最经典的漫画，一本不会因时间久远而疏离的书。"
    }, {
        "cover":"book4-6",
        "bid": "650988",
        "name": "胡麻的天空",
        "intro": "一本让每个人怀念，以及重新认识母亲的书。"
    }, {
        "cover":"book4-7",
        "bid": "834842",
        "name": "心花朵朵",
        "intro": "没生过娃的看了会笑，生过娃的看了却会哭。"
    }, {
        "cover":"book4-8",
        "bid": "650566",
        "name": "最后的耍猴人",
        "intro": "《中国国家地理》摄影师，耗时12年跟拍作品集。"
    }, {
        "cover":"book4-9",
        "bid": "837672",
        "name": "南方草木志",
        "intro": "国内首部，绝美纯手绘植物，抒情散文合集。"
    }, {
        "cover":"book4-10",
        "bid": "757874",
        "name": "时间简史",
        "intro": "霍金经典畅销作品，全球科普著作的时代里程碑。"
    }],
    "6": [{
        "cover":"book7-1",
        "bid": "164524",
        "name": "微微一笑很倾城",
        "intro": "情侣档力荐，收录历年来所有番外！还不快来看？",
        "tag": "高帅富游戏宅"
    }, {
        "cover":"book7-2",
        "bid": "236487",
        "name": "最好的我们",
        "intro": "这一次，与整个青春作别！将情怀与感动，写到极致。",
        "tag": "怀旧那年青春"
    }, {
        "cover":"book7-3",
        "bid": "818544",
        "name": "幻城",
        "intro": "郭敬明讲述冰火神族，弟控哥哥与兄控弟弟的故事。",
        "tag": "兄弟闲来互虐"
    }, {
        "cover":"book7-4",
        "bid": "620388",
        "name": "旋风少女",
        "intro": "晶莹刻骨的爱情，才能配的上让血液都要沸腾的青春。",
        "tag": "超元气美少女"
    }, {
        "cover":"book7-5",
        "bid": "845470",
        "name": "满满都是我对你的爱",
        "intro": "暖萌青春代言人顾西爵，超萌超有爱的自传体小说。"
    }, {
        "cover":"book7-6",
        "bid": "446536",
        "name": "乖，摸摸头",
        "intro": "一本让你时而含泪微笑，时而掩卷长思的奇书。"
    }, {
        "cover":"book7-7",
        "bid": "319833",
        "name": "小时代3.0",
        "intro": "重温三年前的刺金时代，时代姐妹花，友谊天长地久。"
    }, {
        "cover":"book7-8",
        "bid": "849665",
        "name": "后来我们都哭了",
        "intro": "再没有一段青春让你如此荒芜疼痛，暗夜里痛哭失声。"
    }, {
        "cover":"book7-9",
        "bid": "681629",
        "name": "南风知我意",
        "intro": "七微作品，一世只怀一种愁，一生只爱一个人。"
    }, {
        "cover":"book7-10",
        "bid": "534465",
        "name": "同桌冤家:考试真疯狂",
        "intro": "风靡全国中小学，最强校园幽默，超减压读本。"
    }],
    "7": [{
        "cover":"book8-1",
        "bid": "834083",
        "name": "哈利·波特全集",
        "intro": "家喻户晓的闪电疤小魔法师，终于来中国了！",
        "tag": "领你的入学信"
    }, {
        "cover":"book8-2",
        "bid": "182505",
        "name": "滚床单心理学",
        "intro": "为你揭开那些，隐藏在床单下的性福小秘密。",
        "tag": "只想说嘿嘿嘿"
    }, {
        "cover":"book8-3",
        "bid": "244786",
        "name": "从你的全世界路过",
        "intro": "5个故事变成电影，每分钟，都有人在故事里看到自己。",
        "tag": "年少时曾追过"
    }, {
        "cover":"book8-4",
        "bid": "182590",
        "name": "三生三世 十里桃花",
        "intro": "唐七笔下，不可错过的入骨相思。影视快上映了哟~~",
        "tag": "那些入骨相思"
    }, {
        "cover":"book8-5",
        "bid": "747586",
        "name": "你的孤独，虽败犹荣",
        "intro": "愿你不怕一人独处，愿日后谈起时你会被自己感动。"
    }, {
        "cover":"book8-6",
        "bid": "808460",
        "name": "我不喜欢这世界，我只喜欢你",
        "intro": "暖！萌！甜！每一段都令人笑出声来，然后默默流泪。"
    }, {
        "cover":"book8-7",
        "bid": "817469",
        "name": "夏有乔木：雅望天堂",
        "intro": "沉重的爱情故事，会留在我们心上那么长……"
    }, {
        "cover":"book8-8",
        "bid": "847729",
        "name": "放弃我 抓紧我",
        "intro": "任时光匆匆流去，我不改初心，还只在乎你。"
    }, {
        "cover":"book8-9",
        "bid": "750578",
        "name": "囚徒健身",
        "intro": "不需任何器械，只要5平米场地，你也可以完美健身。"
    }, {
        "cover":"book8-10",
        "bid": "627730",
        "name": "18岁后靠自己，你必须懂点经济",
        "intro": "不拼爹成为百万富翁，年轻人最需要的经济学书。"
    }],
    "8": [{
        "cover":"book9-1",
        "bid": "546339",
        "name": "追风筝的人",
        "intro": "快乐大本营高圆圆感动推荐，奥巴马送给女儿的新年礼物。",
        "tag": "一个人的救赎"
    }, {
        "cover":"book9-2",
        "bid": "432471",
        "name": "腾讯传",
        "intro": "吴晓波耗时5年力作，腾讯官方授权的权威传记。",
        "tag": "带你探秘鹅厂"
    }, {
        "cover":"book9-3",
        "bid": "635800",
        "name": "人类简史",
        "intro": "扎克伯格推荐过这本书，据说全世界只有1%的人能看懂。",
        "tag": "造物主诞生记"
    }, {
        "cover":"book9-4",
        "bid": "788041",
        "name": "侯卫东官场笔记",
        "intro": "公务员必读！逐层讲透村、镇、县、市、省官场现状。",
        "tag": "官场生存手册"
    }, {
        "cover":"book9-5",
        "bid": "449752",
        "name": "解忧杂货店",
        "intro": "不是传统的推理小说，却更扣人心弦，引人深思。"
    }, {
        "cover":"book9-6",
        "bid": "675678",
        "name": "大秦帝国",
        "intro": "从政必备，从商必读，细致整理大佬精英的做事方略。"
    }, {
        "cover":"book9-7",
        "bid": "822995",
        "name": "明朝那些事全集",
        "intro": "细数明朝十七帝、王公权贵，和小人物的命运……"
    }, {
        "cover":"book9-8",
        "bid": "792130",
        "name": "你只是看起来很努力",
        "intro": "说你呢！看起来每天熬夜，却只是拿着手机点了无数个赞。"
    }, {
        "cover":"book9-9",
        "bid": "715280",
        "name": "大江东去",
        "intro": "《欢乐颂》作者阿耐代表作，描写改革开放30年的奇书！"
    }, {
        "cover":"book9-10",
        "bid": "823534",
        "name": "巨人的陨落",
        "intro": "全球读者平均3个通宵读完的超级巨著，每三秒卖出一本！"
    }]
}
var bdtitle=[
    {title:"年度剁手榜",desc:"大家都买，你买了吗"},
    {title:"午夜搜索最多的书",desc:"看他们偷偷在看啥"},
    {title:"只有广电总局看过",desc:"未删减剧情大放送"},
    {title:"这些书名辣眼睛",desc:"名字雷到爆炸，到底写的啥"},
    {title:"八卦头条搬运工",desc:"明星为啥爱出书？可能是想上头条"},
    {title:"颜值担当在这里",desc:"书中自有颜如玉，真的"},
    {title:"年纪大了看不懂",desc:"怪蜀黍请走开"},
    {title:"上铺兄弟在看啥",desc:"反正不是高数课本"},
    {title:"老司机上路指南",desc:"画风可能和你想的有点不同"}
]
var sharelist=[
    {
        "cover":"book10-1",
        "bid": "803852",
        "name": "太子妃升职记",
        "price": "15.5"
    },
     {
        "cover":"book10-2",
        "bid": "319833",
        "name": "小时代3.0",
        "price": "8.99"
    },
     {
        "cover":"book10-3",
        "bid": "740261",
        "name": "如何处理仇人的骨灰",
        "price": "1.99"
    },
    {
        "cover":"book10-4",
        "bid": "825037",
        "name": "我不是潘金莲",
        "price": "5.99"
    },
     {
        "cover":"book10-5",
        "bid": "818544",
        "name": "幻城",
        "price": "4.99"
    },
     {
        "cover":"book10-6",
        "bid": "845470",
        "name": "满满都是我对你的爱",
        "price": "8.99"
    }
]