const data={
	// isLogin:false,
	// gene:0,//0出版，1男，2女
	// receive:false,
	// quanNUm:'678',
	// count:'0301142',
	bookMan:[
	{
		bid: '7788417503439802',
		cover: "./src/images/manimg/0.jpg",
		title: "航海王（全彩版）",
		author: "",
		category: "搞笑",
		label:'人气',
		classid:'50011',
		intro:'时值大海盗时代，为了寻找传说中海盗王罗杰所留下的大秘宝“ONE PIECE”，无数海盗扬起旗帜，互相争斗。一个叫路飞的少年为了与因救他而断臂的杰克斯的约定而出海，在旅途中不断寻找志同道合的伙伴，开始了以成为海盗王为目标的伟大冒险旅程！',
		
	},{
		bid: '7782521204336702',
		cover: "./src/images/manimg/1.jpg",
		title: "斗破苍穹",
		author: "",
		category: "热血",
		label:'畅销',
		classid:'50002',
		intro:'这里是属于斗气的世界，没有花俏艳丽的魔法，有的，仅仅是繁衍到巅峰的斗气！ 想要知道异界的斗气在发展到巅峰之后是何种境地吗？',
		
	},{
		bid: '7782521304337002',
		cover: "./src/images/manimg/2.jpg",
		title: "偷星九月天",
		author: "",
		category: "热血",
		label:'火爆',
		classid:'50002',
		intro:'一场爱与梦冒险……是男仆还是热血侦探？是江洋大盗还是美女“主人”？迷雾一层层的解开，从琉星的VV学院的奇特异能，到九月的黑月铁骑们魅影闪现，十月、沧月、玄月、贪狼、莉莉丝稀疏登场……纽约篇、燕国篇精彩不断……千年前的卡伦卡亚命运渐渐解开……',
		
	},{
		bid: '7788819304605902',
		cover: "./src/images/manimg/3.jpg",
		title: "斗罗大陆Ⅱ绝世唐门",
		author: "",
		category: "热血",
		label:'好评',
		classid:'50002',
		intro:'唐家三少人气经典同名作品改编。这里没有其他，只有武魂。斗罗大陆舍我其谁？武魂觉醒谁与争锋！当最强者挺身而出时，当兄弟七人齐心协力时，唐门暗器能否重振雄风，唐门能否再现辉煌，一切尽在绝世唐门。',
		
	},{
		bid: '7789552904647902',
		cover: "./src/images/manimg/4.jpg",
		title: "我为苍生",
		author: "",
		category: "恐怖",
		label:'热门',
		classid:'50015',
		intro:'那些年我相信有一种律法叫天道，那些年我知道有一种命运叫轮回。那些年我掌握了一种占卜叫经验，那些年我记得有一种长生不死叫僵尸，那些年，那些我遇到的离奇诡异的事件！',
		
	},{
		bid: '7788815504603402',
		cover: "./src/images/manimg/6.jpg",
		title: "血色苍穹",
		author: "",
		category: "恐怖",
		label:'必看',
		classid:'50015',
		intro:'只因为手贱扫描了一个以为是商家促销的二维码，正准备赶去与女朋友约会的李鸣洋被带到一个莫名其妙的地方…',
		
	}],
	bookWoman:[{
		bid: '7788815404602602',
		cover: "./src/images/womanimg/0.jpg",
		title: "拐个皇帝回现代",
		author: "",
		category: "玄幻",
		label:'人气',
		classid:'50006',
		intro:'孤女冯丰莫名穿越到古代，被皇帝联合他的一堆后宫折腾欺负，谁知风云变幻，找个机会捞了皇帝一起回现代！且看暴君如何在21世纪接受妹子的强悍改造！',
		
	},{
		bid: '7788819203465002',
		cover: "./src/images/womanimg/2.jpg",
		title: "国民老公带回家：偷吻55次",
		author: "",
		category: "恋爱",
		label:'畅销',
		classid:'50003',
		intro:'“不许公共场合碰我。” “不许公开说我是你妻子。” “不许让人知道我跟你住在一起。” 陆瑾年和安好因为父母之命被迫结婚，安好以为他们的婚姻，就是人前冷漠，人后缠绵。 所以，新婚之夜，她跟他一开口就连续说了三个不许…',
		
	},{
		bid: '7789275304629702',
		cover: "./src/images/womanimg/3.jpg",
		title: "霸情恶少：调教小逃妻",
		author: "",
		category: "都市",
		label:'火爆',
		classid:'50005',
		intro:'“不许动我妈！”一男一女两个娃，把恶魔少总堵门外。他瞄上的女人，不但被别人占了先，还结了两个果！“偷心贼你给我出来！”面对疯狂咆哮帝，辣妈很纯很无辜……N年前，被无辜污了清白，是她的错吗？拜托变态占有狂，她也是受害者好不好！咦？这男人肿么和自己儿子有点像？莫非……',
		
	},{
		bid: '7782287303189302',
		cover: "./src/images/womanimg/4.jpg",
		title: "他来了，请闭眼",
		author: "",
		category: "悬疑",
		label:'好评',
		classid:'50008',
		intro:'全球著名犯罪心理学家薄靳言身为副教授，聪明、傲娇、忠犬、高智商低情商，而简瑶甜美温柔、敏锐聪慧。智商无上限、情商无下限的单细胞生物掉落爱情陷阱。两人相处情景欢乐爆笑，在一起又一起案件中日久生情，从平静平凡的生活，携手走向刺激又肆意人生。',
		
	},{
		bid: '7788815503464102',
		cover: "./src/images/womanimg/5.jpg",
		title: "男神在隔壁",
		author: "",
		category: "恋爱",
		label:'热门',
		classid:'50003',
		intro:'当隔壁搬来一个傲娇、自大、智商爆棚情商几乎为零的帅哥，双双的人生彻底被颠覆了，第一天就来了一个警察局一日游。 苏双双决定此仇不报非女子，没想报复计划很顺利。结果却很意外，傲娇boss却对双双一副你捡了大便宜的样子说道：“既然你搅黄了我的婚事，那就拿你自己赔吧！”......',
		
	},{
		bid: '7903932003689401',
		cover: "./src/images/womanimg/6.jpg",
		title: "九重紫",
		author: "",
		category: "恋爱",
		label:'必看',
		classid:'50003',
		intro:'女主窦昭死而重生，重回小时候，再次亲眼见证了母亲因父亲的背叛伤心欲绝，拔剑自刎的场景。然而，究竟什么才是真相？母亲去世的背后，是否隐藏这不为人知的秘密？新来继母柔弱外表下，是何狼子野心？父亲为何突然要将她嫁入宫中？这是生她养她的家吗？是爱她的父亲吗？',
		
	}],
	bookPublish:[{
		bid:"7788417503439802",
		cover: "./src/images/publishimg/0.jpg",
		title: "航海王（全彩版）",
		author: "",
		category: "搞笑",
		label:'人气',
		classid:'50011',
		intro:'时值大海盗时代，为了寻找传说中海盗王罗杰所留下的大秘宝“ONE PIECE”，无数海盗扬起旗帜，互相争斗。一个叫路飞的少年为了与因救他而断臂的杰克斯的约定而出海，在旅途中不断寻找志同道合的伙伴，开始了以成为海盗王为目标的伟大冒险旅程！',
		
	},{
		bid: '7782521204336702',
		cover: "./src/images/publishimg/1.jpg",
		title: "斗破苍穹",
		author: "",
		category: "热血",
		label:'热门',
		classid:'50002',
		intro:'这里是属于斗气的世界，没有花俏艳丽的魔法，有的，仅仅是繁衍到巅峰的斗气！ 想要知道异界的斗气在发展到巅峰之后是何种境地吗？',
		
	},{
		bid: '7788819304605902',
		cover: "./src/images/publishimg/2.jpg",
		title: "斗罗大陆Ⅱ绝世唐门",
		author: "",
		category: "热血",
		label:'好评',
		classid:'50002',
		intro:'唐家三少人气经典同名作品改编。这里没有其他，只有武魂。斗罗大陆舍我其谁？武魂觉醒谁与争锋！当最强者挺身而出时，当兄弟七人齐心协力时，唐门暗器能否重振雄风，唐门能否再现辉煌，一切尽在绝世唐门。',
		
	},{
		bid: '7789552904647902',
		cover: "./src/images/publishimg/3.jpg",
		title: "我为苍生",
		author: "",
		category: "恐怖",
		label:'热门',
		classid:'50015',
		intro:'那些年我相信有一种律法叫天道，那些年我知道有一种命运叫轮回。那些年我掌握了一种占卜叫经验，那些年我记得有一种长生不死叫僵尸，那些年，那些我遇到的离奇诡异的事件！',
		
	},{
		bid: '7788815504603402',
		cover: "./src/images/publishimg/4.jpg",
		title: "血色苍穹",
		author: "",
		category: "恐怖",
		label:'必看',
		classid:'50015',
		intro:'只因为手贱扫描了一个以为是商家促销的二维码，正准备赶去与女朋友约会的李鸣洋被带到一个莫名其妙的地方…',
		
	},{
		bid: '7789275203488002',
		cover: "./src/images/publishimg/5.jpg",
		title: "极品辣妈好V5",
		author: "",
		category: "都市",
		label:'火爆',
		classid:'50005',
		intro:'她是杀手雇佣中心的顶级杀手，谁知被小阿姨下套，将她扔给了陌生男，结果怀上了宝宝。当她想要追问小阿姨孩子的父亲是谁时，小阿姨脚底抹油跑了……六年后，宝宝阴差阳错的被黑夜帝国的人抓走。无奈之下，她只有女扮男装假装成司机潜伏入黑夜帝国老大身边做卧底……',
		
	 }],
}
export default data;