var data={
"picked100":true,
"bookspicked":[465964,407914],
'monthpicked':false,
"isLogin": true,
"addall":true,
"isVip": false,
"booklist2": [
{
"author": "烛阳",
"cover": "http://wfqqreader.3g.qq.com/cover/770/166770/o_166770.jpg",
"title": "盗墓鬼话",
"bid": 166770,
"intro": "冯四与老头子等五人前往滇黔边境盗墓，不想在墓中遭遇意外，只有冯四一人依靠敏锐的方向感逃了出来，晕倒在墓外。 可是当他醒来的时候，却发现自己是在陈记当铺，而且距离他晕倒的时候，已经是一个月前的事情，更不可思议的事是，他竟然是自己从滇黔边境回来的……"
},
{
"author": "欧阳莉",
"cover": "http://wfqqreader.3g.qq.com/cover/239/204239/o_204239.jpg",
"title": "僵爱：僵尸王的新娘",
"bid": 204239,
"intro": "为了找出杀害自己弟弟的杀人犯，她误闯入埋葬僵尸的山洞，她的血意外唤醒了沉睡几百年的僵尸王。他是一个半人半尸、蛮横霸道、冷酷绝情的冷血动物。从此展开一个人与半尸之间的爱恨纠缠，伴随着一系列杀人事件和一起起恶鬼与世间的恩恩怨怨，真相逐渐浮出水面！谁才是真正的幕后黑手？这背后隐藏着怎样的阴谋？为了争宠不择手段的她们，究竟谁能笑到最后？穿越了几百年的爱恨情仇能否找化解？请你和我一同走进僵尸与人类的爱情故事，慢慢解谜……欢迎大家加我的QQ：1461979118，也可以加入《僵爱》读者群：84294625 一起讨论剧情。新浪认证微博：欧阳莉"
},
{
"author": "扬扬",
"cover": "http://wfqqreader.3g.qq.com/cover/745/122745/o_122745.jpg",
"title": "恋上校草的吻",
"bid": 122745,
"intro": "吴天昊，一个很有权势的流氓混混，黑龙帮的老大！当他失去自己的挚爱的时候，心中就藏有着一个悲痛的故事！这个悲痛的故事除了他只有一个人知道！当他遇到跟以前深爱的女子性格脾气一模一样的时候，对她特别注意。这女子对他有好感的时候，他却退缩了……以前的感情在他的心底留下了很重的阴影！他能否走出这段阴影重新一段新的感情？当女主爱上心中藏有悲伤爱情故事，当女主爱上心藏着另一个前女友，当女主爱上心中藏着那个亏欠的前女友的时候，她又如何？"
},
{
"author": "迷你垂耳兔",
"cover": "http://wfqqreader.3g.qq.com/cover/963/13640963/o_13640963.jpg",
"title": "夺嫡带上猫",
"bid": 13640963,
"intro": "朕能登基为帝，此猫功不可没，夺嫡请带上猫~\r\n垂耳兔君羊：483-057-054"
},
{
"author": "冷青衫",
"cover": "http://wfqqreader.3g.qq.com/cover/914/407914/o_407914.jpg",
"title": "冷宫欢",
"bid": 407914,
"intro": "改朝换代，山河动荡，她一个小小的侍读得到太子的垂青，却在一夜风流之后，惨遭抛弃。\r\n妖女，淫/妇，骂名接踵而来，和亲、封妃、被废，她的人生被彻底改变。\r\n却不知道，那一夜，改变自己的人，是谁。\r\n她要怎么做，才能让一切回到当初，即使是冷宫里，那段平静的岁月？"
},
{
"author": "扬扬",
"cover": "http://wfqqreader.3g.qq.com/cover/745/122745/o_122745.jpg",
"title": "恋上校草的吻",
"bid": 122745,
"intro": "吴天昊，一个很有权势的流氓混混，黑龙帮的老大！当他失去自己的挚爱的时候，心中就藏有着一个悲痛的故事！这个悲痛的故事除了他只有一个人知道！当他遇到跟以前深爱的女子性格脾气一模一样的时候，对她特别注意。这女子对他有好感的时候，他却退缩了……以前的感情在他的心底留下了很重的阴影！他能否走出这段阴影重新一段新的感情？当女主爱上心中藏有悲伤爱情故事，当女主爱上心藏着另一个前女友，当女主爱上心中藏着那个亏欠的前女友的时候，她又如何？"
},
{
"author": "迷你垂耳兔",
"cover": "http://wfqqreader.3g.qq.com/cover/963/13640963/o_13640963.jpg",
"title": "夺嫡带上猫",
"bid": 13640963,
"intro": "朕能登基为帝，此猫功不可没，夺嫡请带上猫~\r\n垂耳兔君羊：483-057-054"
},
{
"author": "冷青衫",
"cover": "http://wfqqreader.3g.qq.com/cover/914/407914/o_407914.jpg",
"title": "冷宫欢",
"bid": 407914,
"intro": "改朝换代，山河动荡，她一个小小的侍读得到太子的垂青，却在一夜风流之后，惨遭抛弃。\r\n妖女，淫/妇，骂名接踵而来，和亲、封妃、被废，她的人生被彻底改变。\r\n却不知道，那一夜，改变自己的人，是谁。\r\n她要怎么做，才能让一切回到当初，即使是冷宫里，那段平静的岁月？"
},
{
"author": "血蝠",
"cover": "http://wfqqreader.3g.qq.com/cover/964/465964/o_465964.jpg",
"title": "苏联英雄",
"bid": 465964,
"intro": "战火纷飞，国家英雄东线崛起。激情燃烧，战斗在苏维埃的红旗下！"
}
],
"booklist1": [
{
"author": "纳兰凌风",
"cover": "http://wfqqreader.3g.qq.com/cover/604/510604/o_510604.jpg",
"title": "最强败家子",
"price": 5,
"bid": 510604,
"intro": "任务：贵族气质的培养，第一支线任务：在面前这个商厦2个小时内消费花掉2000万，并且所购买的商品是你自己可以使用的。任务奖励：积分200，所购买的物品所有权。任务失败：惩罚未知。\r\n当这个外星人将任务读出来之后，刘飞整个人都傻了。\r\n不过，你确认这任务培养出来的是贵族气质，不是暴发户气质？\r\n被外星人砸中的刘飞，看着外星人给出的任务，还有那兑换无数先进物品的列表，满脸的蛋疼。"
},
{
"author": "树下尾狐",
"cover": "http://wfqqreader.3g.qq.com/cover/953/252953/o_252953.jpg",
"title": "都市之超级兵王",
"price": 5,
"bid": 252953,
"intro": "尾狐新书《女总裁的贴身护卫》，希望大家多多支持。\r\n他是战场上让敌人闻风丧胆的冷血兵王；他是队友中让人哭笑不得的兵痞混混；他是都市黑道众人向往的大哥；他是少女美妇心中的男神；他带着任务回来了……\r\n   统一黑道，建立经济帝国，誓要成为这世界的霸主……\r\n　为了防止世界被破坏 为了保护世界和平 贯彻爱与真实的邪恶 可爱又迷人的反派角色，他是向羽，他为自己代言……\r\n　　"
},
{
"author": "鸿蒙树",
"cover": "http://wfqqreader.3g.qq.com/cover/82/264082/o_264082.jpg",
"title": "天才透视眼",
"price": 5,
"bid": 264082,
"intro": "因为触电而引发异能，主角从此走出了一条全新的道路，无限的世界展现出来！\r\n置身花都，一双透视眼看尽人间一切。\r\n想法？能看！\r\n修为？能看！\r\n功法？能看！\r\n女人？这个……也是可以的吧……"
}
]
}
module.exports=data;